module.exports = {
  "arrowParens": "always", // Определяет, должны ли параметры стрелочных функций быть обернуты в скобки. Значение "always" означает, что всегда нужно оборачивать.
  "bracketSpacing": true, // Указывает, следует ли добавлять пробелы вокруг фигурных скобок в объектах и массивах.
  "endOfLine": "auto", // Определяет стиль конца строки. Значение "auto" автоматически выбирает стиль в зависимости от операционной системы.
  "htmlWhitespaceSensitivity": "css", // Определяет, как обрабатывать пробелы внутри тегов HTML. Значение "css" означает, что пробелы будут обрабатываться как в CSS.
  "insertPragma": false, // Определяет, следует ли добавлять специальный комментарий в начало файла для индикации, что файл был отформатирован Prettier'ом.
  "bracketSameLine": false, // Указывает, должна ли открывающаяся фигурная скобка быть на той же строке, что и соответствующее ключевое слово.
  "jsxSingleQuote": false, // Определяет, следует ли использовать одинарные или двойные кавычки в JSX-атрибутах.
  "printWidth": 100, // Максимальное количество символов на строку перед тем, как Prettier выполнит перенос строки.
  "proseWrap": "preserve", // Определяет, как обрабатывать текст внутри элементов, таких как теги <pre> или <textarea>. Значение "preserve" сохраняет исходное форматирование.
  "quoteProps": "as-needed", // Определяет, когда заключать в кавычки свойства объектов. Значение "as-needed" добавляет кавычки только в случае необходимости.
  "requirePragma": false, // Определяет, требуется ли комментарий Prettier pragma для форматирования файла.
  "semi": true, // Определяет, следует ли ставить точку с запятой в конце выражений.
  "singleQuote": true, // Определяет, следует ли использовать одинарные кавычки для строковых литералов.
  "tabWidth": 2, // Количество пробелов, которые представляют один уровень отступа (в случае использования пробелов вместо табуляции).
  "useTabs": false, // Определяет, следует ли использовать табуляцию вместо пробелов для отступов.
}
